; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob15) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate12)
	(at pallet2 depot2)
	(clear crate6)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate9)
	(at pallet5 distributor2)
	(clear crate8)
	(at pallet6 distributor0)
	(clear crate10)
	(at pallet7 depot2)
	(clear crate7)
	(at pallet8 distributor1)
	(clear crate5)
	(at pallet9 distributor0)
	(clear crate11)
	(at pallet10 depot1)
	(clear pallet10)
	(at truck0 distributor2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 458)
	(at truck1 distributor2)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 207)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(= (weight crate0) 36)
	(at crate1 depot1)
	(on crate1 pallet1)
	(= (weight crate1) 24)
	(at crate2 depot2)
	(on crate2 pallet2)
	(= (weight crate2) 88)
	(at crate3 distributor0)
	(on crate3 pallet6)
	(= (weight crate3) 58)
	(at crate4 depot2)
	(on crate4 pallet7)
	(= (weight crate4) 60)
	(at crate5 distributor1)
	(on crate5 pallet8)
	(= (weight crate5) 64)
	(at crate6 depot2)
	(on crate6 crate2)
	(= (weight crate6) 72)
	(at crate7 depot2)
	(on crate7 crate4)
	(= (weight crate7) 98)
	(at crate8 distributor2)
	(on crate8 crate0)
	(= (weight crate8) 81)
	(at crate9 distributor1)
	(on crate9 pallet4)
	(= (weight crate9) 77)
	(at crate10 distributor0)
	(on crate10 crate3)
	(= (weight crate10) 41)
	(at crate11 distributor0)
	(on crate11 pallet9)
	(= (weight crate11) 66)
	(at crate12 depot1)
	(on crate12 crate1)
	(= (weight crate12) 60)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate2)
		(on crate1 pallet6)
		(on crate2 pallet2)
		(on crate3 pallet5)
		(on crate4 crate8)
		(on crate5 crate6)
		(on crate6 pallet10)
		(on crate7 pallet4)
		(on crate8 pallet9)
		(on crate9 pallet1)
		(on crate10 crate4)
		(on crate11 pallet0)
		(on crate12 pallet7)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist2 crate6 crate2 depot2)
   deleted: (at crate6 depot2) (clear crate6) (available hoist2) (on crate6 crate2)
   added: (lifting hoist2 crate6) (clear crate2)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 13
2. (lift hoist6 crate10 crate3 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist6) (on crate10 crate3)
   added: (lifting hoist6 crate10) (clear crate3)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 13
3. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 2 to 12
   goals met: 1 of 13
4. (load hoist6 crate10 truck0 distributor0)
   deleted: (lifting hoist6 crate10)
   added: (in crate10 truck0) (available hoist6)
   changed: (current_load truck0) from 0 to 41
   goals met: 1 of 13
5. (lift hoist6 crate3 pallet6 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist6) (on crate3 pallet6)
   added: (lifting hoist6 crate3) (clear pallet6)
   changed: (fuel-cost) from 12 to 13
   goals met: 1 of 13
6. (load hoist6 crate3 truck0 distributor0)
   deleted: (lifting hoist6 crate3)
   added: (in crate3 truck0) (available hoist6)
   changed: (current_load truck0) from 41 to 99
   goals met: 1 of 13
7. (lift hoist6 crate11 pallet9 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist6) (on crate11 pallet9)
   added: (lifting hoist6 crate11) (clear pallet9)
   changed: (fuel-cost) from 13 to 14
   goals met: 1 of 13
8. (load hoist6 crate11 truck0 distributor0)
   deleted: (lifting hoist6 crate11)
   added: (in crate11 truck0) (available hoist6)
   changed: (current_load truck0) from 99 to 165
   goals met: 1 of 13
9. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 14 to 24
   goals met: 1 of 13
10. (unload hoist0 crate11 truck0 depot0)
   deleted: (in crate11 truck0) (available hoist0)
   added: (lifting hoist0 crate11)
   changed: (current_load truck0) from 165 to 99
   goals met: 1 of 13
11. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 24 to 34
   goals met: 1 of 13
12. (drop hoist0 crate11 pallet0 depot0)
   deleted: (lifting hoist0 crate11) (clear pallet0)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 pallet0)
   goals met: 2 of 13
13. (unload hoist5 crate3 truck0 distributor2)
   deleted: (in crate3 truck0) (available hoist5)
   added: (lifting hoist5 crate3)
   changed: (current_load truck0) from 99 to 41
   goals met: 2 of 13
14. (drop hoist2 crate6 crate2 depot2)
   deleted: (lifting hoist2 crate6) (clear crate2)
   added: (available hoist2) (at crate6 depot2) (clear crate6) (on crate6 crate2)
   goals met: 2 of 13
15. (lift hoist4 crate5 pallet8 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 pallet8)
   added: (lifting hoist4 crate5) (clear pallet8)
   changed: (fuel-cost) from 34 to 35
   goals met: 2 of 13
16. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 35 to 45
   goals met: 2 of 13
17. (load hoist4 crate5 truck0 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck0) (available hoist4)
   changed: (current_load truck0) from 41 to 105
   goals met: 2 of 13
18. (lift hoist4 crate9 pallet4 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 pallet4)
   added: (lifting hoist4 crate9) (clear pallet4)
   changed: (fuel-cost) from 45 to 46
   goals met: 2 of 13
19. (load hoist4 crate9 truck0 distributor1)
   deleted: (lifting hoist4 crate9)
   added: (in crate9 truck0) (available hoist4)
   changed: (current_load truck0) from 105 to 182
   goals met: 2 of 13
20. (lift hoist2 crate7 crate4 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 crate4)
   added: (lifting hoist2 crate7) (clear crate4)
   changed: (fuel-cost) from 46 to 47
   goals met: 2 of 13
21. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 47 to 57
   goals met: 2 of 13
22. (load hoist2 crate7 truck0 depot2)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   changed: (current_load truck0) from 182 to 280
   goals met: 2 of 13
23. (unload hoist2 crate5 truck0 depot2)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   changed: (current_load truck0) from 280 to 216
   goals met: 2 of 13
24. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 57 to 67
   goals met: 2 of 13
25. (unload hoist4 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist4)
   added: (lifting hoist4 crate7)
   changed: (current_load truck0) from 216 to 118
   goals met: 2 of 13
26. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 67 to 77
   goals met: 2 of 13
27. (drop hoist4 crate7 pallet4 distributor1)
   deleted: (lifting hoist4 crate7) (clear pallet4)
   added: (available hoist4) (at crate7 distributor1) (clear crate7) (on crate7 pallet4)
   goals met: 3 of 13
28. (lift hoist1 crate12 crate1 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist1) (on crate12 crate1)
   added: (lifting hoist1 crate12) (clear crate1)
   changed: (fuel-cost) from 77 to 78
   goals met: 3 of 13
29. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 78 to 88
   goals met: 3 of 13
30. (load hoist1 crate12 truck0 depot1)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck0) (available hoist1)
   changed: (current_load truck0) from 118 to 178
   goals met: 3 of 13
31. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 88 to 89
   goals met: 3 of 13
32. (load hoist1 crate1 truck0 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 178 to 202
   goals met: 3 of 13
33. (unload hoist1 crate9 truck0 depot1)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck0) from 202 to 125
   goals met: 3 of 13
34. (drop hoist1 crate9 pallet1 depot1)
   deleted: (lifting hoist1 crate9) (clear pallet1)
   added: (available hoist1) (at crate9 depot1) (clear crate9) (on crate9 pallet1)
   goals met: 4 of 13
35. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 89 to 99
   goals met: 4 of 13
36. (unload hoist3 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist3)
   added: (lifting hoist3 crate1)
   changed: (current_load truck0) from 125 to 101
   goals met: 4 of 13
37. (drop hoist3 crate1 pallet6 distributor0)
   deleted: (lifting hoist3 crate1) (clear pallet6)
   added: (available hoist3) (at crate1 distributor0) (clear crate1) (on crate1 pallet6)
   goals met: 5 of 13
38. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 99 to 109
   goals met: 5 of 13
39. (drop hoist2 crate5 crate6 depot2)
   deleted: (lifting hoist2 crate5) (clear crate6)
   added: (available hoist2) (at crate5 depot2) (clear crate5) (on crate5 crate6)
   goals met: 6 of 13
40. (unload hoist2 crate10 truck0 depot2)
   deleted: (in crate10 truck0) (available hoist2)
   added: (lifting hoist2 crate10)
   changed: (current_load truck0) from 101 to 60
   goals met: 6 of 13
41. (load hoist5 crate3 truck1 distributor2)
   deleted: (lifting hoist5 crate3)
   added: (in crate3 truck1) (available hoist5)
   changed: (current_load truck1) from 0 to 58
   goals met: 6 of 13
42. (lift hoist5 crate8 crate0 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 crate0)
   added: (lifting hoist5 crate8) (clear crate0)
   changed: (fuel-cost) from 109 to 110
   goals met: 6 of 13
43. (load hoist5 crate8 truck1 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck1) (available hoist5)
   changed: (current_load truck1) from 58 to 139
   goals met: 6 of 13
44. (lift hoist5 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet5)
   added: (lifting hoist5 crate0) (clear pallet5)
   changed: (fuel-cost) from 110 to 111
   goals met: 6 of 13
45. (load hoist5 crate0 truck1 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck1) (available hoist5)
   changed: (current_load truck1) from 139 to 175
   goals met: 6 of 13
46. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 111 to 121
   goals met: 6 of 13
47. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   changed: (fuel-cost) from 121 to 131
   goals met: 6 of 13
48. (unload hoist5 crate3 truck1 distributor2)
   deleted: (in crate3 truck1) (available hoist5)
   added: (lifting hoist5 crate3)
   changed: (current_load truck1) from 175 to 117
   goals met: 6 of 13
49. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 131 to 141
   goals met: 6 of 13
50. (drop hoist5 crate3 pallet5 distributor2)
   deleted: (lifting hoist5 crate3) (clear pallet5)
   added: (available hoist5) (at crate3 distributor2) (clear crate3) (on crate3 pallet5)
   goals met: 7 of 13
51. (unload hoist3 crate8 truck1 distributor0)
   deleted: (in crate8 truck1) (available hoist3)
   added: (lifting hoist3 crate8)
   changed: (current_load truck1) from 117 to 36
   goals met: 7 of 13
52. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 141 to 151
   goals met: 7 of 13
53. (load hoist2 crate10 truck1 depot2)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck1) (available hoist2)
   changed: (current_load truck1) from 36 to 77
   goals met: 7 of 13
54. (drop hoist3 crate8 pallet9 distributor0)
   deleted: (lifting hoist3 crate8) (clear pallet9)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 pallet9)
   goals met: 8 of 13
55. (lift hoist2 crate4 pallet7 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 pallet7)
   added: (lifting hoist2 crate4) (clear pallet7)
   changed: (fuel-cost) from 151 to 152
   goals met: 8 of 13
56. (load hoist2 crate4 truck0 depot2)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 60 to 120
   goals met: 8 of 13
57. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 152 to 162
   goals met: 8 of 13
58. (unload hoist3 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist3)
   added: (lifting hoist3 crate4)
   changed: (current_load truck0) from 120 to 60
   goals met: 8 of 13
59. (drop hoist3 crate4 crate8 distributor0)
   deleted: (lifting hoist3 crate4) (clear crate8)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 crate8)
   goals met: 9 of 13
60. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 162 to 172
   goals met: 9 of 13
61. (unload hoist2 crate12 truck0 depot2)
   deleted: (in crate12 truck0) (available hoist2)
   added: (lifting hoist2 crate12)
   changed: (current_load truck0) from 60 to 0
   goals met: 9 of 13
62. (drop hoist2 crate12 pallet7 depot2)
   deleted: (lifting hoist2 crate12) (clear pallet7)
   added: (available hoist2) (at crate12 depot2) (clear crate12) (on crate12 pallet7)
   goals met: 10 of 13
63. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 172 to 182
   goals met: 10 of 13
64. (unload hoist3 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist3)
   added: (lifting hoist3 crate10)
   changed: (current_load truck1) from 77 to 36
   goals met: 10 of 13
65. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 182 to 192
   goals met: 10 of 13
66. (drop hoist3 crate10 crate4 distributor0)
   deleted: (lifting hoist3 crate10) (clear crate4)
   added: (available hoist3) (at crate10 distributor0) (clear crate10) (on crate10 crate4)
   goals met: 11 of 13
67. (lift hoist2 crate5 crate6 depot2)
   deleted: (at crate5 depot2) (clear crate5) (available hoist2) (on crate5 crate6)
   added: (lifting hoist2 crate5) (clear crate6)
   changed: (fuel-cost) from 192 to 193
   goals met: 10 of 13
68. (load hoist2 crate5 truck1 depot2)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   changed: (current_load truck1) from 36 to 100
   goals met: 10 of 13
69. (lift hoist2 crate6 crate2 depot2)
   deleted: (at crate6 depot2) (clear crate6) (available hoist2) (on crate6 crate2)
   added: (lifting hoist2 crate6) (clear crate2)
   changed: (fuel-cost) from 193 to 194
   goals met: 10 of 13
70. (load hoist2 crate6 truck1 depot2)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 100 to 172
   goals met: 10 of 13
71. (drive truck1 depot2 depot1)
   deleted: (at truck1 depot2)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 194 to 204
   goals met: 10 of 13
72. (unload hoist1 crate6 truck1 depot1)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck1) from 172 to 100
   goals met: 10 of 13
73. (drop hoist1 crate6 pallet10 depot1)
   deleted: (lifting hoist1 crate6) (clear pallet10)
   added: (available hoist1) (at crate6 depot1) (clear crate6) (on crate6 pallet10)
   goals met: 11 of 13
74. (unload hoist1 crate5 truck1 depot1)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck1) from 100 to 36
   goals met: 11 of 13
75. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 204 to 214
   goals met: 11 of 13
76. (unload hoist2 crate0 truck1 depot2)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck1) from 36 to 0
   goals met: 11 of 13
77. (drop hoist2 crate0 crate2 depot2)
   deleted: (lifting hoist2 crate0) (clear crate2)
   added: (available hoist2) (at crate0 depot2) (clear crate0) (on crate0 crate2)
   goals met: 12 of 13
78. (drop hoist1 crate5 crate6 depot1)
   deleted: (lifting hoist1 crate5) (clear crate6)
   added: (available hoist1) (at crate5 depot1) (clear crate5) (on crate5 crate6)
   goals met: 13 of 13
